docs: user custom updates to DATABASE_SCHEMA.md
